app/controllers/employeelists_controller.rb

  def index
    @employeelists = Employeelist.all
---
SELECT "employeelists".* FROM "employeelists"