app/controllers/lists_controller.rb

INSERT INTO "lists" ("employee_name", "age", "gender", "designation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["employee_name", "Ajish"], ["age", "25"], ["gender", "MALE"], ["designation", "JUNIOR"], ["created_at", "2022-01-21 12:13:02.343837"], ["updated_at", "2022-01-21 12:13:02.343837"]]
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save

UPDATE "lists" SET "designation" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["designation", "JUNI76"], ["updated_at", "2022-01-22 05:30:12.441169"], ["id", 30]]
---
  def update
    respond_to do |format|
      if @list.update(list_params)